' 文字コード指定で一気に置換
' 参考：https://www.moug.net/tech/exvba/0140015.html

Dim str, str2
str = "abc｢ｱｲｳｴｵ｡｢ｶｷｸｹｺ｣､ｻﾞｼﾞｽﾞｾﾞｿﾞ･ﾊﾟﾋﾟﾌﾟﾍﾟﾎﾟdef"

msgbox ExchangeHanKana2Wide(str)


Function ExchangeHanKana2Wide(str)
	Dim aryHan, aryZen
	aryHan = Array( _
		"｡","｢","｣","､","･","ｦ", _
		"ｧ","ｨ","ｩ","ｪ","ｫ","ｬ","ｭ","ｮ","ｯ","ｰ", _
		"ｱ","ｲ","ｳ","ｴ","ｵ", _
		"ｶ","ｷ","ｸ","ｹ","ｺ", _
		"ｻ","ｼ","ｽ","ｾ","ｿ", _
		"ﾀ","ﾁ","ﾂ","ﾃ","ﾄ", _
		"ﾅ","ﾆ","ﾇ","ﾈ","ﾉ", _
		"ﾊ","ﾋ","ﾌ","ﾍ","ﾎ", _
		"ﾏ","ﾐ","ﾑ","ﾒ","ﾓ", _
		"ﾔ","ﾕ","ﾖ","ﾗ","ﾘ", _
		"ﾙ","ﾚ","ﾛ","ﾜ","ﾝ", _
		"ﾞ","ﾟ")
	
	aryZen = Array( _
		"。","「","」","、","・","ヲ", _
		"ァ","ィ","ゥ","ェ","ォ","ャ","ュ","ョ","ッ","ー", _
		"ア","イ","ウ","エ","オ", _
		"カ","キ","ク","ケ","コ", _
		"サ","シ","ス","セ","ソ", _
		"タ","チ","ツ","テ","ト", _
		"ナ","ニ","ヌ","ネ","ノ", _
		"ハ","ヒ","フ","ヘ","ホ", _
		"マ","ミ","ム","メ","モ", _
		"ヤ","ユ","ヨ","ラ","リ", _
		"ル","レ","ロ","ワ","ン", _
		"゛","゜")

	' 全部の文字に対して置換を呼ぶ（なんだかなぁ・・・）
	Dim ub : ub = UBound(aryHan)
	Dim i
	For i=0 to ub
		str = Replace(str, aryHan(i), aryZen(i))
	Next
	
	ExchangeHanKana2Wide = str
End Function

